cf/InformationRegisters/ProductsCodesPeripheralOffline.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ProductsCodesPeripheralOffline</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ProductsAndServices</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesBatches</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MeasurementUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UOM</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Used</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ExchangeRule</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExchangeWithPeripheralsOfflineRules</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Code</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ProductsAndServicesBarcodes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ProductsAndServicesBarcodes</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ProductsAndServices</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Batch</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesBatches</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MeasurementUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UOM</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/PeripheralTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>PeripheralTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>BarCodeScanner</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MagneticCardReader</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FiscalRegister</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerDisplay</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DataCollectionTerminal</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POSTerminal</Name>
					<Comment>POSTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ElectronicScales</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LabelsPrintingScales</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CashRegistersOffline</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/Peripherals.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Peripherals</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>EquipmentType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PeripheralTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeviceIdentifier</Name>
					<Comment>Unique identifier of hardware standard device</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeviceDisconnected</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeviceIsInUse</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HardwareDriver</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HardwareDrivers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Parameters</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Workplace</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Workplaces</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReinstallationRequired</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InstallationIsRequired</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRule</Name>
					<Comment>Intended for exchange with offline equipment</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ExchangeWithPeripheralsOfflineRules</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InfobaseNode</Name>
					<Comment>Intended for exchange with offline equipment</Comment>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ExchangeWithPeripheralsOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SerialNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ComponentVersion</Name>
					<Comment>Component Version</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteDriverHandler</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PeripheralDriverHandlers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/DataExchangePeripheralsOfflineEvents/Ext/Module.bsl
Procedure RegisterCatalogChanges(Source, Cancel) Export
	
	If Source.DataExchange.Load Then
		Return;
	EndIf;
	
	SetPrivilegedMode(True);
	
	SourceType = TypeOf(Source);
	If SourceType = Type("CatalogObject.ProductsAndServices") Then
		
		Query = New Query(
		"SELECT
		|	ProductsCodesPeripheralOffline.ExchangeRule AS ExchangeRule,
		|	ProductsCodesPeripheralOffline.Code AS Code,
		|	Peripherals.InfobaseNode AS InfobaseNode
		|FROM
		|	InformationRegister.ProductsCodesPeripheralOffline AS ProductsCodesPeripheralOffline
		|		LEFT JOIN Catalog.Peripherals AS Peripherals
		|		ON ProductsCodesPeripheralOffline.ExchangeRule = Peripherals.ExchangeRule
		|WHERE
		|	ProductsCodesPeripheralOffline.Used
		|	AND Peripherals.InfobaseNode <> VALUE(ExchangePlan.ExchangeWithPeripheralsOffline.EmptyRef)
		|	AND ProductsCodesPeripheralOffline.ProductsAndServices = &Value
		|	AND (ProductsCodesPeripheralOffline.ProductsAndServices.Description <> &ValueName
		|	OR CAST(ProductsCodesPeripheralOffline.ProductsAndServices.DescriptionFull AS String(1024)) <> CAST(&DescriptionFullValue AS String(1024)))");
		
		Query.SetParameter("DescriptionFullValue", Source.DescriptionFull);
		
	ElsIf SourceType = Type("CatalogObject.ProductsAndServicesCharacteristics") Then
		
		Query = New Query(
		"SELECT
		|	ProductsCodesPeripheralOffline.ExchangeRule AS ExchangeRule,
		|	ProductsCodesPeripheralOffline.Code AS Code,
		|	Peripherals.InfobaseNode AS InfobaseNode
		|FROM
		|	InformationRegister.ProductsCodesPeripheralOffline AS ProductsCodesPeripheralOffline
		|		LEFT JOIN Catalog.Peripherals AS Peripherals
		|		ON ProductsCodesPeripheralOffline.ExchangeRule = Peripherals.ExchangeRule
		|WHERE
		|	ProductsCodesPeripheralOffline.Used
		|	AND Peripherals.InfobaseNode <> VALUE(ExchangePlan.ExchangeWithPeripheralsOffline.EmptyRef)
		|	AND ProductsCodesPeripheralOffline.Characteristic = &Value
		|	AND ProductsCodesPeripheralOffline.Characteristic.Description <> &ValueName");
		
	ElsIf SourceType = Type("CatalogObject.ProductsAndServicesBatches") Then
		
		Query = New Query(
		"SELECT
		|	ProductsCodesPeripheralOffline.ExchangeRule AS ExchangeRule,
		|	ProductsCodesPeripheralOffline.Code AS Code,
		|	Peripherals.InfobaseNode AS InfobaseNode
		|FROM
		|	InformationRegister.ProductsCodesPeripheralOffline AS ProductsCodesPeripheralOffline
		|		LEFT JOIN Catalog.Peripherals AS Peripherals
		|		ON ProductsCodesPeripheralOffline.ExchangeRule = Peripherals.ExchangeRule
		|WHERE
		|	ProductsCodesPeripheralOffline.Used
		|	AND Peripherals.InfobaseNode <> VALUE(ExchangePlan.ExchangeWithPeripheralsOffline.EmptyRef)
		|	AND ProductsCodesPeripheralOffline.Batch = &Value
		|	AND ProductsCodesPeripheralOffline.Batch.Description <> &ValueName");
		
	ElsIf SourceType = Type("CatalogObject.UOM") Then
		
		Query = New Query(
		"SELECT
		|	ProductsCodesPeripheralOffline.ExchangeRule AS ExchangeRule,
		|	ProductsCodesPeripheralOffline.Code AS Code,
		|	Peripherals.InfobaseNode AS InfobaseNode
		|FROM
		|	InformationRegister.ProductsCodesPeripheralOffline AS ProductsCodesPeripheralOffline
		|		LEFT JOIN Catalog.Peripherals AS Peripherals
		|		ON ProductsCodesPeripheralOffline.ExchangeRule = Peripherals.ExchangeRule
		|WHERE
		|	ProductsCodesPeripheralOffline.Used
		|	AND Peripherals.InfobaseNode <> VALUE(ExchangePlan.ExchangeWithPeripheralsOffline.EmptyRef)
		|	AND ProductsCodesPeripheralOffline.MeasurementUnit = &Value
		|	AND ProductsCodesPeripheralOffline.MeasurementUnit.Description <> &ValueName");
	
	ElsIf SourceType = Type("CatalogObject.ProductsAndServicesCategories") Then
		
		Query = New Query(
		"SELECT
		|	ProductsCodesPeripheralOffline.ExchangeRule AS ExchangeRule,
		|	ProductsCodesPeripheralOffline.Code AS Code,
		|	Peripherals.InfobaseNode AS InfobaseNode
		|FROM
		|	InformationRegister.ProductsCodesPeripheralOffline AS ProductsCodesPeripheralOffline
		|		LEFT JOIN Catalog.Peripherals AS Peripherals
		|		ON ProductsCodesPeripheralOffline.ExchangeRule = Peripherals.ExchangeRule
		|WHERE
		|	ProductsCodesPeripheralOffline.Used
		|	AND Peripherals.InfobaseNode <> VALUE(ExchangePlan.ExchangeWithPeripheralsOffline.EmptyRef)
		|	AND ProductsCodesPeripheralOffline.ProductsAndServices.ProductsAndServicesCategory = &Value");
		
	ElsIf SourceType = Type("CatalogObject.Peripherals") Then
		
		If  ValueIsFilled(Source.InfobaseNode)
			AND ValueIsFilled(Source.ExchangeRule)
			AND Source.ExchangeRule <> Source.Ref.ExchangeRule
			AND (Source.EquipmentType = Enums.PeripheralTypes.CashRegistersOffline
			   OR Source.EquipmentType = Enums.PeripheralTypes.LabelsPrintingScales) Then
			
			ExchangePlans.DeleteChangeRecords(Source.InfobaseNode);
			
			Query = New Query(
			"SELECT
			|	ProductsCodesPeripheralOffline.ExchangeRule AS ExchangeRule,
			|	ProductsCodesPeripheralOffline.Code           AS Code,
			|	&InfobaseNode                                   AS InfobaseNode
			|FROM
			|	InformationRegister.ProductsCodesPeripheralOffline AS ProductsCodesPeripheralOffline
			|WHERE
			|	ProductsCodesPeripheralOffline.ExchangeRule = &ExchangeRule");
			
			Query.SetParameter("ExchangeRule", Source.ExchangeRule);
			Query.SetParameter("InfobaseNode", Source.InfobaseNode);
			
		Else
			Return;
		EndIf;
		
	Else
		Return;
	EndIf;
	
	Query.SetParameter("Value",             Source.Ref);
	Query.SetParameter("ValueName", Source.Description);
	
	Result = Query.Execute();
	Selection = Result.Select();
	
	Set = InformationRegisters.ProductsCodesPeripheralOffline.CreateRecordSet();
	While Selection.Next() Do
		
		Set.Filter.ExchangeRule.Value = Selection.ExchangeRule;
		Set.Filter.ExchangeRule.Use = True;
		
		Set.Filter.Code.Value = Selection.Code;
		Set.Filter.Code.Use = True;
		
		ExchangePlans.RecordChanges(Selection.InfobaseNode, Set);
	
	EndDo;
	
EndProcedure

Procedure RegisterInformationRegisterChanges(Source, Cancel, Replacing) Export
	
	If Source.DataExchange.Load Then
		Return;
	EndIf;
	
	SetPrivilegedMode(True);
	
	SourceType = TypeOf(Source);
	If SourceType = Type("InformationRegisterRecordSet.ProductsAndServicesBarcodes") Then
		
		Query = New Query(
		"SELECT
		|	ProductsCodesPeripheralOffline.ExchangeRule AS ExchangeRule,
		|	ProductsCodesPeripheralOffline.Code AS Code,
		|	Peripherals.InfobaseNode AS InfobaseNode
		|FROM
		|	InformationRegister.ProductsCodesPeripheralOffline AS ProductsCodesPeripheralOffline
		|		LEFT JOIN Catalog.Peripherals AS Peripherals
		|		ON ProductsCodesPeripheralOffline.ExchangeRule = Peripherals.ExchangeRule
		|		LEFT JOIN InformationRegister.ProductsAndServicesBarcodes AS ProductsAndServicesBarcodes
		|		ON ProductsCodesPeripheralOffline.ProductsAndServices = ProductsAndServicesBarcodes.ProductsAndServices
		|			AND ProductsCodesPeripheralOffline.Characteristic = ProductsAndServicesBarcodes.Characteristic
		|			AND ProductsCodesPeripheralOffline.Batch = ProductsAndServicesBarcodes.Batch
		|			AND ProductsCodesPeripheralOffline.MeasurementUnit = ProductsAndServicesBarcodes.MeasurementUnit
		|WHERE
		|	ProductsCodesPeripheralOffline.Used
		|	AND Peripherals.InfobaseNode <> VALUE(ExchangePlan.ExchangeWithPeripheralsOffline.EmptyRef)
		|	AND ProductsAndServicesBarcodes.Barcode = &Value");
		
		Query.SetParameter("Value", Source.Filter.Barcode.Value);
		
	Else
		Return;
	EndIf;
	
	Result = Query.Execute();
	Selection = Result.Select();
	
	Set = InformationRegisters.ProductsCodesPeripheralOffline.CreateRecordSet();
	While Selection.Next() Do
		
		Set.Filter.ExchangeRule.Value = Selection.ExchangeRule;
		Set.Filter.ExchangeRule.Use = True;
		
		Set.Filter.Code.Value = Selection.Code;
		Set.Filter.Code.Use = True;
		
		ExchangePlans.RecordChanges(Selection.InfobaseNode, Set);
	
	EndDo;
	
EndProcedure

Procedure CreateExchangeNodeWithOfflinePeripherals(Source, Cancel) Export
	
	If Not ValueIsFilled(Source.InfobaseNode)
		AND (Source.EquipmentType = Enums.PeripheralTypes.CashRegistersOffline
		OR Source.EquipmentType = Enums.PeripheralTypes.LabelsPrintingScales) Then
		Source.InfobaseNode = EquipmentManagerServerCallOverridable.GetDIBNode(Source);
	EndIf;
	
	Source.AdditionalProperties.Insert("ChangedExchangeRule", Source.ExchangeRule <> Source.Ref.ExchangeRule);
	
EndProcedure

Procedure ClearExchangeNodeWithOfflinePeripherals(Source, CopiedObject) Export
	
	Source.InfobaseNode = ExchangePlans.ExchangeWithPeripheralsOffline.EmptyRef();
	
EndProcedure

Procedure RegisterChangesOnPeripheralsExchangeRuleChange(Source, Cancel) Export
	
	If Source.DataExchange.Load Then
		Return;
	EndIf;
	
	If (Source.EquipmentType = Enums.PeripheralTypes.CashRegistersOffline
		OR Source.EquipmentType = Enums.PeripheralTypes.LabelsPrintingScales)
		AND Source.AdditionalProperties.ChangedExchangeRule Then
		
		SetPrivilegedMode(True);
		ExchangePlans.RecordChanges(Source.InfobaseNode, Metadata.InformationRegisters.ProductsCodesPeripheralOffline);
		
	EndIf;
	
EndProcedure
